semestr2/algorytmy i struktury danych/cwiczenia/cw01/cw1.tex
% Created 2023-03-01 Wed 21:17
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{01.03.2023}
\title{algortmy i struktury danych ćwiczenia 1}
\hypersetup{
 pdfauthor={},
 pdftitle={algortmy i struktury danych ćwiczenia 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Algorytm}
\label{sec:org09d73af}
Etapy rozwiązania problemu:
\begin{enumerate}
\item cel + dane wejściowe / wyjściowe
\item analiza problemu -- model matematyczny
\item wybór metody rozwiązania
\item opracowanie algorytmu w postaci
\begin{enumerate}
\item opis słowny
\item lista kroków
\item schemat blokowy
\item kod programu
\end{enumerate}
\item Analiza poprawności rozwiązania -- testy
\item Ocena effektywności rozwiązania
\end{enumerate}
\subsection{Cechy}
\label{sec:org96a6f27}
\begin{itemize}
\item Prostota
\item Skończoność
\item Określony
\item Efektywny
\end{itemize}
\subsection{Przykłady}
\label{sec:org33de3d8}
\subsubsection{\(ax+b=0\)}
\label{sec:org375e2e1}
\begin{enumerate}
\item Opis słowny :: Należy rozwiązać równanie
\label{sec:org2aa661d}
\item Lista kroków:
\label{sec:org5381ed6}
\\[0pt]
krok 0: \(a,b \in \mathbb{R}, x = ?\)
\\[0pt]
krok 1: \(a \ne 0\) to wtedy \(x = - \displaystyle\frac{b}{a}\)
\\[0pt]
krok 2: \(a = 0\) i \(b = 0\) to wtedy \(x \in \mathbb{R}\). wypisz ``\(\infty\) rozwiązań''.
\\[0pt]
krok 3: \(0 = 0\) i \(b \ne 0\) to wtedy wypisz ``brak rozwiązań''
\item {\bfseries\sffamily TODO} Schemat blokowy
\label{sec:org8400a61}

Będzie na kolokwium.
\item {\bfseries\sffamily DONE} Kod
\label{sec:org98d4d91}

Implementacja w języku C
\begin{verbatim}
#include <stdio.h>

int main() {
  double a, b, x;
  puts("podaj a,b");
  scanf("%lf%lf", &a, &b);
  if (a != 0) {
    x = -b / a;
    printf("%lf", x);
  } else if (b == 0)
    puts("\\infty rozwiązań.");
  else
    puts("Brak rozwiązań");
  return 0;
}
\end{verbatim}
\end{enumerate}
\end{document}